cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432E411Y.svd
        <register>
          <name>DMACTL6</name>
          <description>USB DMA Control 6</description>
          <addressOffset>0x00000264</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_DMACTL6_ENABLE</name>
              <description>DMA Transfer Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_DMACTL6_DIR</name>
              <description>DMA Direction</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_DMACTL6_MODE</name>
              <description>DMA Transfer Mode</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_DMACTL6_IE</name>
              <description>DMA Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_DMACTL6_EP</name>
              <description>Endpoint number</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>USB_DMACTL6_ERR</name>
              <description>Bus Error Bit</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>USB_DMACTL6_BRSTM</name>
              <description>Burst Mode</description>
              <bitRange>[10:9]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_DMACTL6_BRSTM_ANY</name>
                  <description>Bursts of unspecified length</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DMACTL6_BRSTM_INC4</name>
                  <description>INCR4 or unspecified length</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DMACTL6_BRSTM_INC8</name>
                  <description>INCR8, INCR4 or unspecified length</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DMACTL6_BRSTM_INC16</name>
                  <description>INCR16, INCR8, INCR4 or unspecified length</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAADDR6</name>
          <description>USB DMA Address 6</description>
          <addressOffset>0x00000268</addressOffset>
          <fields>
            <field>
              <name>USB_DMAADDR6_ADDR</name>
              <description>DMA Address</description>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACOUNT6</name>
          <description>USB DMA Count 6</description>
          <addressOffset>0x0000026C</addressOffset>
          <fields>
            <field>
              <name>USB_DMACOUNT6_COUNT</name>
              <description>DMA Count</description>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACTL7</name>
          <description>USB DMA Control 7</description>
          <addressOffset>0x00000274</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_DMACTL7_ENABLE</name>
              <description>DMA Transfer Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_DMACTL7_DIR</name>
              <description>DMA Direction</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_DMACTL7_MODE</name>
              <description>DMA Transfer Mode</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_DMACTL7_IE</name>
              <description>DMA Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_DMACTL7_EP</name>
              <description>Endpoint number</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>USB_DMACTL7_ERR</name>
              <description>Bus Error Bit</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>USB_DMACTL7_BRSTM</name>
              <description>Burst Mode</description>
              <bitRange>[10:9]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_DMACTL7_BRSTM_ANY</name>
                  <description>Bursts of unspecified length</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DMACTL7_BRSTM_INC4</name>
                  <description>INCR4 or unspecified length</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DMACTL7_BRSTM_INC8</name>
                  <description>INCR8, INCR4 or unspecified length</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DMACTL7_BRSTM_INC16</name>
                  <description>INCR16, INCR8, INCR4 or unspecified length</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAADDR7</name>
          <description>USB DMA Address 7</description>
          <addressOffset>0x00000278</addressOffset>
          <fields>
            <field>
              <name>USB_DMAADDR7_ADDR</name>
              <description>DMA Address</description>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACOUNT7</name>
          <description>USB DMA Count 7</description>
          <addressOffset>0x0000027C</addressOffset>
          <fields>
            <field>
              <name>USB_DMACOUNT7_COUNT</name>
              <description>DMA Count</description>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RQPKTCOUNT1</name>
          <description>USB Request Packet Count in Block Transfer Endpoint 1</description>
          <addressOffset>0x00000304</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RQPKTCOUNT1</name>
              <description>Block Transfer Packet Count</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RQPKTCOUNT2</name>
          <description>USB Request Packet Count in Block Transfer Endpoint 2</description>
          <addressOffset>0x00000308</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RQPKTCOUNT2</name>
              <description>Block Transfer Packet Count</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RQPKTCOUNT3</name>
          <description>USB Request Packet Count in Block Transfer Endpoint 3</description>
          <addressOffset>0x0000030C</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RQPKTCOUNT3</name>
              <description>Block Transfer Packet Count</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RQPKTCOUNT4</name>
          <description>USB Request Packet Count in Block Transfer Endpoint 4</description>
          <addressOffset>0x00000310</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RQPKTCOUNT4_COUNT</name>
              <description>Block Transfer Packet Count</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RQPKTCOUNT5</name>
          <description>USB Request Packet Count in Block Transfer Endpoint 5</description>
          <addressOffset>0x00000314</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RQPKTCOUNT5_COUNT</name>
              <description>Block Transfer Packet Count</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RQPKTCOUNT6</name>
          <description>USB Request Packet Count in Block Transfer Endpoint 6</description>
          <addressOffset>0x00000318</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RQPKTCOUNT6_COUNT</name>
              <description>Block Transfer Packet Count</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RQPKTCOUNT7</name>
          <description>USB Request Packet Count in Block Transfer Endpoint 7</description>
          <addressOffset>0x0000031C</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RQPKTCOUNT7_COUNT</name>
              <description>Block Transfer Packet Count</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXDPKTBUFDIS</name>
          <description>USB Receive Double Packet Buffer Disable</description>
          <addressOffset>0x00000340</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXDPKTBUFDIS_EP1</name>
              <description>EP1 RX Double-Packet Buffer Disable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_RXDPKTBUFDIS_EP2</name>
              <description>EP2 RX Double-Packet Buffer Disable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_RXDPKTBUFDIS_EP3</name>
              <description>EP3 RX Double-Packet Buffer Disable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_RXDPKTBUFDIS_EP4</name>
              <description>EP4 RX Double-Packet Buffer Disable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXDPKTBUFDIS_EP5</name>
              <description>EP5 RX Double-Packet Buffer Disable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_RXDPKTBUFDIS_EP6</name>
              <description>EP6 RX Double-Packet Buffer Disable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_RXDPKTBUFDIS_EP7</name>
              <description>EP7 RX Double-Packet Buffer Disable</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDPKTBUFDIS</name>
          <description>USB Transmit Double Packet Buffer Disable</description>
          <addressOffset>0x00000342</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_TXDPKTBUFDIS_EP1</name>
              <description>EP1 TX Double-Packet Buffer Disable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_TXDPKTBUFDIS_EP2</name>
              <description>EP2 TX Double-Packet Buffer Disable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_TXDPKTBUFDIS_EP3</name>
              <description>EP3 TX Double-Packet Buffer Disable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_TXDPKTBUFDIS_EP4</name>
              <description>EP4 TX Double-Packet Buffer Disable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_TXDPKTBUFDIS_EP5</name>
              <description>EP5 TX Double-Packet Buffer Disable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_TXDPKTBUFDIS_EP6</name>
              <description>EP6 TX Double-Packet Buffer Disable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_TXDPKTBUFDIS_EP7</name>
              <description>EP7 TX Double-Packet Buffer Disable</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTO</name>
          <description>USB Chirp Timeout</description>
          <addressOffset>0x00000344</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_CTO_CCTV</name>
              <description>Configurable Chirp Timeout Value</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HHSRTN</name>
          <description>USB High Speed to UTM Operating Delay</description>
          <addressOffset>0x00000346</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_HHSRTN_HHSRTN</name>
              <description>HIgh Speed to UTM Operating Delay</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HSBT</name>
          <description>USB High Speed Time-out Adder</description>
          <addressOffset>0x00000348</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_HSBT_HSBT</name>
              <description>High Speed Timeout Adder</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LPMATTR</name>
          <description>USB LPM Attributes</description>
          <addressOffset>0x00000360</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_LPMATTR_LS</name>
              <description>Link State</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_LPMATTR_LS_L1</name>
                  <description>Sleep State (L1)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_LPMATTR_HIRD</name>
              <description>Host Initiated Resume Duration</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>USB_LPMATTR_RMTWAK</name>
              <description>Remote Wake</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>USB_LPMATTR_ENDPT</name>
              <description>Endpoint</description>
              <bitRange>[15:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LPMCNTRL</name>
          <description>USB LPM Control</description>
          <addressOffset>0x00000362</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_LPMCNTRL_TXLPM</name>
              <description>Transmit LPM Transaction Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_LPMCNTRL_RES</name>
              <description>LPM Resume</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_LPMCNTRL_EN</name>
              <description>LPM Enable</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_LPMCNTRL_EN_NONE</name>
                  <description>LPM and Extended transactions are not supported. In this case, the USB does not respond to LPM transactions and LPM transactions cause a timeout</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_LPMCNTRL_EN_EXT</name>
                  <description>LPM is not supported but extended transactions are supported. In this case, the USB does respond to an LPM transaction with a STALL</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_LPMCNTRL_EN_LPMEXT</name>
                  <description>The USB supports LPM extended transactions. In this case, the USB responds with a NYET or an ACK as determined by the value of TXLPM and other conditions</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_LPMCNTRL_NAK</name>
              <description>LPM NAK</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LPMIM</name>
          <description>USB LPM Interrupt Mask</description>
          <addressOffset>0x00000363</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_LPMIM_STALL</name>
              <description>LPM STALL Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_LPMIM_NY</name>
              <description>LPM NY Interrupt Mask</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_LPMIM_ACK</name>
              <description>LPM ACK Interrupt Mask</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_LPMIM_NC</name>
              <description>LPM NC Interrupt Mask</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_LPMIM_RES</name>
              <description>LPM Resume Interrupt Mask</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_LPMIM_ERR</name>
              <description>LPM Error Interrupt Mask</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LPMRIS</name>
          <description>USB LPM Raw Interrupt Status</description>
          <addressOffset>0x00000364</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_LPMRIS_LPMST</name>
              <description>LPM STALL Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_LPMRIS_NY</name>
              <description>LPM NY Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_LPMRIS_ACK</name>
              <description>LPM ACK Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_LPMRIS_NC</name>
              <description>LPM NC Interrupt Status</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_LPMRIS_RES</name>
              <description>LPM Resume Interrupt Status</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_LPMRIS_ERR</name>
              <description>LPM Interrupt Status</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LPMFADDR</name>
          <description>USB LPM Function Address</description>
          <addressOffset>0x00000365</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_LPMFADDR_ADDR</name>
              <description>LPM Function Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
