cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432E411Y.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ONEWIRE0</name>
      <description>Register map for ONEWIRE0 peripheral</description>
      <groupName>ONEWIRE</groupName>
      <prependToName>ONEWIRE0</prependToName>
      <baseAddress>0x400B6000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt><name>ONEWIRE0</name><value>105</value></interrupt>
      <registers>
        <register>
          <name>CS</name>
          <description>1-Wire Control and Status</description>
          <addressOffset>0x00000000</addressOffset>
          <fields>
            <field>
              <name>ONEWIRE_CS_RST</name>
              <description>Reset Request</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ONEWIRE_CS_OP</name>
              <description>Operation Request</description>
              <bitRange>[2:1]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONEWIRE_CS_OP_NONE</name>
                  <description>No operation</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONEWIRE_CS_OP_RD</name>
                  <description>Read</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONEWIRE_CS_OP_WR</name>
                  <description>Write</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONEWIRE_CS_OP_WRRD</name>
                  <description>Write/Read</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ONEWIRE_CS_SZ</name>
              <description>Data Operation Size</description>
              <bitRange>[4:3]</bitRange>
            </field>
            <field>
              <name>ONEWIRE_CS_ODRV</name>
              <description>Overdrive Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ONEWIRE_CS_LSAM</name>
              <description>Late Sample Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ONEWIRE_CS_SKATR</name>
              <description>Skip Answer-to-Reset Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ONEWIRE_CS_BUSY</name>
              <description>Busy Status</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ONEWIRE_CS_NOATR</name>
              <description>Answer-to-Reset Status</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ONEWIRE_CS_STUCK</name>
              <description>STUCK Status</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ONEWIRE_CS_BSIZE</name>
              <description>Last Byte Size</description>
              <bitRange>[18:16]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONEWIRE_CS_BSIZE_8</name>
                  <description>8 bits (1 byte)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONEWIRE_CS_BSIZE_1</name>
                  <description>1 bit</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONEWIRE_CS_BSIZE_2</name>
                  <description>2 bits</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONEWIRE_CS_BSIZE_3</name>
                  <description>3 bits</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONEWIRE_CS_BSIZE_4</name>
                  <description>4 bits</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONEWIRE_CS_BSIZE_5</name>
                  <description>5 bits</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONEWIRE_CS_BSIZE_6</name>
                  <description>6 bits</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONEWIRE_CS_BSIZE_7</name>
                  <description>7 bits</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ONEWIRE_CS_ALTP</name>
              <description>Alternate Polarity Enable</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>ONEWIRE_CS_USEALT</name>
              <description>Two Wire Enable</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TIM</name>
          <description>1-Wire Timing Override</description>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>ONEWIRE_TIM_RSTTIM</name>
              <description>Reset Low Time</description>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>ONEWIRE_TIM_ATRTIM</name>
              <description>Answer-to-Reset/Rest Period</description>
              <bitRange>[10:6]</bitRange>
            </field>
            <field>
              <name>ONEWIRE_TIM_ATRSAM</name>
              <description>Answer-to-Reset Sample</description>
              <bitRange>[14:11]</bitRange>
            </field>
            <field>
              <name>ONEWIRE_TIM_W1SAM</name>
              <description>Sample Time</description>
              <bitRange>[18:15]</bitRange>
            </field>
            <field>
              <name>ONEWIRE_TIM_W0REST</name>
              <description>Rest Time</description>
              <bitRange>[22:19]</bitRange>
            </field>
            <field>
              <name>ONEWIRE_TIM_W0TIM</name>
              <description>Value '0' Timing</description>
              <bitRange>[27:23]</bitRange>
            </field>
            <field>
              <name>ONEWIRE_TIM_W1TIM</name>
              <description>Value '1' Timing</description>
              <bitRange>[31:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DATW</name>
          <description>1-Wire Data Write</description>
          <addressOffset>0x00000008</addressOffset>
          <fields>
            <field>
              <name>ONEWIRE_DATW_B0</name>
              <description>Lowest Data Byte</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>ONEWIRE_DATW_B1</name>
              <description>Lower Middle Data Byte</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>ONEWIRE_DATW_B2</name>
              <description>Upper Middle Data Byte</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>ONEWIRE_DATW_B3</name>
              <description>Upper Data Byte</description>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DATR</name>
          <description>1-Wire Data Read</description>
          <addressOffset>0x0000000C</addressOffset>
          <fields>
            <field>
              <name>ONEWIRE_DATR_B0</name>
              <description>Lowest Data Byte</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>ONEWIRE_DATR_B1</name>
              <description>Lower Middle Data Byte</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>ONEWIRE_DATR_B2</name>
              <description>Upper Middle Data Byte</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>ONEWIRE_DATR_B3</name>
              <description>Upper Data Byte</description>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IM</name>
          <description>1-Wire Interrupt Mask</description>
          <addressOffset>0x00000100</addressOffset>
          <fields>
            <field>
              <name>ONEWIRE_IM_RST</name>
              <description>Reset Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ONEWIRE_IM_OPC</name>
              <description>Operation Complete Interrupt Mask</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ONEWIRE_IM_NOATR</name>
              <description>No Answer-to-Reset Interrupt Mask</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ONEWIRE_IM_STUCK</name>
              <description>Stuck Status Interrupt Mask</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ONEWIRE_IM_DMA</name>
              <description>DMA Done Interrupt Mask</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RIS</name>
          <description>1-Wire Raw Interrupt Status</description>
          <addressOffset>0x00000104</addressOffset>
          <fields>
            <field>
              <name>ONEWIRE_RIS_RST</name>
              <description>Reset Raw Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ONEWIRE_RIS_OPC</name>
              <description>Operation Complete Raw Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ONEWIRE_RIS_NOATR</name>
              <description>No Answer-to-Reset Raw Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ONEWIRE_RIS_STUCK</name>
              <description>Stuck Status Raw Interrupt Status</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ONEWIRE_RIS_DMA</name>
              <description>DMA Done Raw Interrupt Status</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MIS</name>
          <description>1-Wire Masked Interrupt Status</description>
          <addressOffset>0x00000108</addressOffset>
          <fields>
            <field>
              <name>ONEWIRE_MIS_RST</name>
              <description>Reset Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ONEWIRE_MIS_OPC</name>
              <description>Operation Complete Masked Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ONEWIRE_MIS_NOATR</name>
              <description>No Answer-to-Reset Masked Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ONEWIRE_MIS_STUCK</name>
              <description>Stuck Status Masked Interrupt Status</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ONEWIRE_MIS_DMA</name>
              <description>DMA Done Masked Interrupt Status</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <description>1-Wire Interrupt Clear</description>
          <addressOffset>0x0000010C</addressOffset>
          <fields>
            <field>
              <name>ONEWIRE_ICR_RST</name>
              <description>Reset Interrupt Clear</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ONEWIRE_ICR_OPC</name>
              <description>Operation Complete Interrupt Clear</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ONEWIRE_ICR_NOATR</name>
              <description>No Answer-to-Reset Interrupt Clear</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ONEWIRE_ICR_STUCK</name>
              <description>Stuck Status Interrupt Clear</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ONEWIRE_ICR_DMA</name>
              <description>DMA Done Interrupt Clear</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA</name>
          <description>1-Wire uDMA Control</description>
          <addressOffset>0x00000120</addressOffset>
          <fields>
            <field>
              <name>ONEWIRE_DMA_RST</name>
              <description>uDMA Reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ONEWIRE_DMA_DMAOP</name>
              <description>uDMA Operation</description>
              <bitRange>[2:1]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONEWIRE_DMA_DMAOP_DIS</name>
                  <description>uDMA disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONEWIRE_DMA_DMAOP_RDSNG</name>
                  <description>uDMA single read: 1-Wire requests uDMA to read ONEWIREDATR register after each read transaction</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONEWIRE_DMA_DMAOP_WRMUL</name>
                  <description>uDMA multiple write: 1-Wire requests uDMA to load whenever the ONEWIREDATW register is empty</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONEWIRE_DMA_DMAOP_RDMUL</name>
                  <description>uDMA multiple read: An initial read occurs and subsequent reads start after uDMA has read the ONEWIREDATR register</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ONEWIRE_DMA_SG</name>
              <description>Scatter-Gather Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PP</name>
          <description>1-Wire Peripheral Properties</description>
          <addressOffset>0x00000FC0</addressOffset>
          <fields>
            <field>
              <name>ONEWIRE_PP_CNT</name>
              <description>1-Wire Bus Count</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ONEWIRE_PP_DMAP</name>
              <description>uDMA Present</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
