cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432E411Y.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CCM0</name>
      <description>Register map for CCM0 peripheral</description>
      <groupName>CCM</groupName>
      <prependToName>CCM0</prependToName>
      <baseAddress>0x44030204</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00000004</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
            <name>CCMCGREQ</name>
          <description>Cryptographic Modules Clock Gating Request</description>
          <addressOffset>0x00000000</addressOffset>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CRC</name>
      <description>Register map for CRC peripheral</description>
      <groupName>CRC</groupName>
      <baseAddress>0x44030400</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x0000001C</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRL</name>
          <description>CRC Control</description>
          <addressOffset>0x00000000</addressOffset>
          <fields>
            <field>
              <name>CRC_CTRL_TYPE</name>
              <description>Operation Type</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRC_CTRL_TYPE_P8055</name>
                  <description>Polynomial 0x8005</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_CTRL_TYPE_P1021</name>
                  <description>Polynomial 0x1021</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_CTRL_TYPE_P4C11DB7</name>
                  <description>Polynomial 0x4C11DB7</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_CTRL_TYPE_P1EDC6F41</name>
                  <description>Polynomial 0x1EDC6F41</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_CTRL_TYPE_TCPCHKSUM</name>
                  <description>TCP checksum</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRC_CTRL_ENDIAN</name>
              <description>Endian Control</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRC_CTRL_ENDIAN_SBHW</name>
                  <description>Configuration unchanged. (B3, B2, B1, B0)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_CTRL_ENDIAN_SHW</name>
                  <description>Bytes are swapped in half-words but half-words are not swapped (B2, B3, B0, B1)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_CTRL_ENDIAN_SHWNB</name>
                  <description>Half-words are swapped but bytes are not swapped in half-word. (B1, B0, B3, B2)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_CTRL_ENDIAN_SBSW</name>
                  <description>Bytes are swapped in half-words and half-words are swapped. (B0, B1, B2, B3)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRC_CTRL_BR</name>
              <description>Bit reverse enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CRC_CTRL_OBR</name>
              <description>Output Reverse Enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CRC_CTRL_RESINV</name>
              <description>Result Inverse Enable</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CRC_CTRL_SIZE</name>
              <description>Input Data Size</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CRC_CTRL_INIT</name>
              <description>CRC Initialization</description>
              <bitRange>[14:13]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRC_CTRL_INIT_SEED</name>
                  <description>Use the CRCSEED register context as the starting value</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_CTRL_INIT_0</name>
                  <description>Initialize to all '0s'</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_CTRL_INIT_1</name>
                  <description>Initialize to all '1s'</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCSEED</name>
          <description>CRC SEED/Context</description>
          <addressOffset>0x00000010</addressOffset>
          <fields>
            <field>
              <name>CRC_SEED_SEED</name>
              <description>SEED/Context Value</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCDIN</name>
          <description>CRC Data Input</description>
          <addressOffset>0x00000014</addressOffset>
          <fields>
            <field>
              <name>CRC_DIN_DATAIN</name>
              <description>Data Input</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCRSLTPP</name>
          <description>CRC Post Processing Result</description>
          <addressOffset>0x00000018</addressOffset>
          <fields>
            <field>
              <name>CRC_RSLTPP_RSLTPP</name>
              <description>Post Processing Result</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
