cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432E411Y.svd
        <register>
          <name>DATA_IN_1</name>
          <description>AES Data RW Plaintext/Ciphertext 1</description>
          <addressOffset>0x00000064</addressOffset>
          <fields>
            <field>
              <name>AES_DATA_IN_1_DATA</name>
              <description>Secure Data RW Plaintext/Ciphertext</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA_IN_2</name>
          <description>AES Data RW Plaintext/Ciphertext 2</description>
          <addressOffset>0x00000068</addressOffset>
          <fields>
            <field>
              <name>AES_DATA_IN_2_DATA</name>
              <description>Secure Data RW Plaintext/Ciphertext</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA_IN_3</name>
          <description>AES Data RW Plaintext/Ciphertext 3</description>
          <addressOffset>0x0000006C</addressOffset>
          <fields>
            <field>
              <name>AES_DATA_IN_3_DATA</name>
              <description>Secure Data RW Plaintext/Ciphertext</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAG_OUT_0</name>
          <description>AES Hash Tag Out 0</description>
          <addressOffset>0x00000070</addressOffset>
          <fields>
            <field>
              <name>AES_TAG_OUT_0_HASH</name>
              <description>Hash Result</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAG_OUT_1</name>
          <description>AES Hash Tag Out 1</description>
          <addressOffset>0x00000074</addressOffset>
          <fields>
            <field>
              <name>AES_TAG_OUT_1_HASH</name>
              <description>Hash Result</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAG_OUT_2</name>
          <description>AES Hash Tag Out 2</description>
          <addressOffset>0x00000078</addressOffset>
          <fields>
            <field>
              <name>AES_TAG_OUT_2_HASH</name>
              <description>Hash Result</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAG_OUT_3</name>
          <description>AES Hash Tag Out 3</description>
          <addressOffset>0x0000007C</addressOffset>
          <fields>
            <field>
              <name>AES_TAG_OUT_3_HASH</name>
              <description>Hash Result</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REVISION</name>
          <description>AES IP Revision Identifier</description>
          <addressOffset>0x00000080</addressOffset>
          <fields>
            <field>
              <name>AES_REVISION</name>
              <description>Revision number</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCONFIG</name>
          <description>AES System Configuration</description>
          <addressOffset>0x00000084</addressOffset>
          <fields>
            <field>
              <name>AES_SYSCONFIG_SOFTRESET</name>
              <description>Soft reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>AES_SYSCONFIG_DMA_REQ_DATA_IN_EN</name>
              <description>DMA Request Data In Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>AES_SYSCONFIG_DMA_REQ_DATA_OUT_EN</name>
              <description>DMA Request Data Out Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>AES_SYSCONFIG_DMA_REQ_CONTEXT_IN_EN</name>
              <description>DMA Request Context In Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>AES_SYSCONFIG_DMA_REQ_CONTEXT_OUT_EN</name>
              <description>DMA Request Context Out Enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>AES_SYSCONFIG_MAP_CONTEXT_OUT_ON_DATA_OUT</name>
              <description>Map Context Out on Data Out Enable</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>AES_SYSCONFIG_KEYENC</name>
              <description>Key Encoding</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>AES_SYSCONFIG_K3</name>
              <description>K3 Select</description>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSSTATUS</name>
          <description>AES System Status</description>
          <addressOffset>0x00000088</addressOffset>
          <fields>
            <field>
              <name>AES_SYSSTATUS_RESETDONE</name>
              <description>Reset Done</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQSTATUS</name>
          <description>AES Interrupt Status</description>
          <addressOffset>0x0000008C</addressOffset>
          <fields>
            <field>
              <name>AES_IRQSTATUS_CONTEXT_IN</name>
              <description>Context In Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>AES_IRQSTATUS_DATA_IN</name>
              <description>Data In Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>AES_IRQSTATUS_DATA_OUT</name>
              <description>Data Out Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>AES_IRQSTATUS_CONTEXT_OUT</name>
              <description>Context Output Interrupt Status</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQENABLE</name>
          <description>AES Interrupt Enable</description>
          <addressOffset>0x00000090</addressOffset>
          <fields>
            <field>
              <name>AES_IRQENABLE_CONTEXT_IN</name>
              <description>Context In Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>AES_IRQENABLE_DATA_IN</name>
              <description>Data In Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>AES_IRQENABLE_DATA_OUT</name>
              <description>Data Out Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>AES_IRQENABLE_CONTEXT_OUT</name>
              <description>Context Out Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DIRTYBITS</name>
          <description>AES Dirty Bits</description>
          <addressOffset>0x00000094</addressOffset>
          <fields>
            <field>
              <name>AES_DIRTYBITS_S_ACCESS</name>
              <description>AES Access Bit</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>AES_DIRTYBITS_S_DIRTY</name>
              <description>AES Dirty Bit</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
