cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432E411Y.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>AES_DMA</name>
      <description>Register map for AES DMA peripheral</description>
      <groupName>AES_DMA</groupName>
      <prependToName>AES_DMA</prependToName>
      <baseAddress>0x44030020</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00000010</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
            <name>AES_DMAIM</name>
            <description>AES DMA Interrupt Mask</description>
            <addressOffset>0x00000000</addressOffset>
            <fields>
                <field>
                    <name>AES_DMAIM_CIN</name>
                    <description>Context In DMA Done Interrupt Mask</description>
                    <bitRange>[0:0]</bitRange>
                </field>
                <field>
                    <name>AES_DMAIM_COUT</name>
                    <description>Context Out DMA Done Interrupt Mask</description>
                    <bitRange>[1:1]</bitRange>
                </field>
                <field>
                    <name>AES_DMAIM_DIN</name>
                    <description>Data In DMA Done Interrupt Mask</description>
                    <bitRange>[2:2]</bitRange>
                </field>
                <field>
                    <name>AES_DMAIM_DOUT</name>
                    <description>Data Out DMA Done Interrupt Mask</description>
                    <bitRange>[3:3]</bitRange>
                </field>
            </fields>
        </register>
        <register>
            <name>AES_DMARIS</name>
            <description>AES DMA Raw Interrupt Status</description>
            <addressOffset>0x00000004</addressOffset>
            <fields>
                <field>
                    <name>AES_DMARIS_CIN</name>
                    <description>Context In DMA Done Raw Interrupt Status</description>
                    <bitRange>[0:0]</bitRange>
                </field>
                <field>
                    <name>AES_DMARIS_COUT</name>
                    <description>Context Out DMA Done Raw Interrupt Status</description>
                    <bitRange>[1:1]</bitRange>
                </field>
                <field>
                    <name>AES_DMARIS_DIN</name>
                    <description>Data In DMA Done Raw Interrupt Status</description>
                    <bitRange>[2:2]</bitRange>
                </field>
                <field>
                    <name>AES_DMARIS_DOUT</name>
                    <description>Data Out DMA Done Raw Interrupt Status</description>
                    <bitRange>[3:3]</bitRange>
                </field>
            </fields>
        </register>
        <register>
            <name>AES_DMAMIS</name>
            <description>AES DMA Masked Interrupt Status</description>
            <addressOffset>0x00000008</addressOffset>
            <fields>
                <field>
                    <name>AES_DMAMIS_CIN</name>
                    <description>Context In DMA Done Masked Interrupt Status</description>
                    <bitRange>[0:0]</bitRange>
                </field>
                <field>
                    <name>AES_DMAMIS_COUT</name>
                    <description>Context Out DMA Done Masked Interrupt Status</description>
                    <bitRange>[1:1]</bitRange>
                </field>
                <field>
                    <name>AES_DMAMIS_DIN</name>
                    <description>Data In DMA Done Masked Interrupt Status</description>
                    <bitRange>[2:2]</bitRange>
                </field>
                <field>
                    <name>AES_DMAMIS_DOUT</name>
                    <description>Data Out DMA Done Masked Interrupt Status</description>
                    <bitRange>[3:3]</bitRange>
                </field>
            </fields>
        </register>
        <register>
            <name>AES_DMAIC</name>
            <description>AES DMA Interrupt Clear</description>
            <addressOffset>0x0000000C</addressOffset>
            <fields>
                <field>
                    <name>AES_DMAIC_CIN</name>
                    <description>Context In DMA Done Interrupt Clear</description>
                    <bitRange>[0:0]</bitRange>
                </field>
                <field>
                    <name>AES_DMAIC_COUT</name>
                    <description>Context Out DMA Done Interrupt Clear</description>
                    <bitRange>[1:1]</bitRange>
                </field>
                <field>
                    <name>AES_DMAIC_DIN</name>
                    <description>Data In DMA Done Interrupt Clear</description>
                    <bitRange>[2:2]</bitRange>
                </field>
                <field>
                    <name>AES_DMAIC_DOUT</name>
                    <description>Data Out DMA Done Interrupt Clear</description>
                    <bitRange>[3:3]</bitRange>
                </field>
            </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DES</name>
      <description>Register map for DES peripheral</description>
      <groupName>DES</groupName>
      <prependToName>DES</prependToName>
      <baseAddress>0x44038000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00002000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>KEY3_L</name>
          <description>DES Key 3 LSW for 192-Bit Key</description>
          <addressOffset>0x00000000</addressOffset>
          <fields>
            <field>
              <name>DES_KEY3_L_KEY</name>
              <description>Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY3_H</name>
          <description>DES Key 3 MSW for 192-Bit Key</description>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>DES_KEY3_H_KEY</name>
              <description>Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY2_L</name>
          <description>DES Key 2 LSW for 128-Bit Key</description>
          <addressOffset>0x00000008</addressOffset>
          <fields>
            <field>
              <name>DES_KEY2_L_KEY</name>
              <description>Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY2_H</name>
          <description>DES Key 2 MSW for 128-Bit Key</description>
          <addressOffset>0x0000000C</addressOffset>
          <fields>
            <field>
              <name>DES_KEY2_H_KEY</name>
              <description>Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY1_L</name>
          <description>DES Key 1 LSW for 64-Bit Key</description>
          <addressOffset>0x00000010</addressOffset>
          <fields>
            <field>
              <name>DES_KEY1_L_KEY</name>
              <description>Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY1_H</name>
          <description>DES Key 1 MSW for 64-Bit Key</description>
          <addressOffset>0x00000014</addressOffset>
          <fields>
            <field>
              <name>DES_KEY1_H_KEY</name>
              <description>Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IV_L</name>
          <description>DES Initialization Vector</description>
          <addressOffset>0x00000018</addressOffset>
          <fields>
            <field>
              <name>DES_IV_L</name>
              <description>Initialization vector for CBC, CFB modes (LSW)</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IV_H</name>
          <description>DES Initialization Vector</description>
          <addressOffset>0x0000001C</addressOffset>
          <fields>
            <field>
              <name>DES_IV_H</name>
              <description>Initialization vector for CBC, CFB modes (MSW)</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>DES Control</description>
          <addressOffset>0x00000020</addressOffset>
          <fields>
            <field>
              <name>DES_CTRL_OUTPUT_READY</name>
              <description>When 1, Data decrypted/encrypted ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DES_CTRL_INPUT_READY</name>
              <description>When 1, ready to encrypt/decrypt data</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>DES_CTRL_DIRECTION</name>
              <description>Select encryption/decryption 0x0: decryption is selected0x1: Encryption is selected</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>DES_CTRL_TDES</name>
              <description>Select DES or triple DES encryption/decryption</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DES_CTRL_MODE</name>
              <description>Select CBC, ECB or CFB mode0x0: ECB mode0x1: CBC mode0x2: CFB mode0x3: reserved</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>DES_CTRL_CONTEXT</name>
              <description>If 1, this read-only status bit indicates that the context data registers can be overwritten and the host is permitted to write the next context</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LENGTH</name>
          <description>DES Cryptographic Data Length</description>
          <addressOffset>0x00000024</addressOffset>
          <fields>
            <field>
              <name>DES_LENGTH</name>
              <description>Cryptographic data length in bytes for all modes</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA_L</name>
          <description>DES LSW Data RW</description>
          <addressOffset>0x00000028</addressOffset>
          <fields>
            <field>
              <name>DES_DATA_L</name>
              <description>Data for encryption/decryption, LSW</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA_H</name>
          <description>DES MSW Data RW</description>
          <addressOffset>0x0000002C</addressOffset>
          <fields>
            <field>
              <name>DES_DATA_H</name>
              <description>Data for encryption/decryption, MSW</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REVISION</name>
          <description>DES Revision Number</description>
          <addressOffset>0x00000030</addressOffset>
          <fields>
            <field>
              <name>DES_REVISION</name>
              <description>Revision number</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCONFIG</name>
          <description>DES System Configuration</description>
          <addressOffset>0x00000034</addressOffset>
          <fields>
            <field>
              <name>DES_SYSCONFIG_SOFTRESET</name>
              <description>Soft reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>DES_SYSCONFIG_SIDLE</name>
              <description>Sidle mode</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DES_SYSCONFIG_SIDLE_FORCE</name>
                  <description>Force-idle mode</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DES_SYSCONFIG_DMA_REQ_DATA_IN_EN</name>
              <description>DMA Request Data In Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DES_SYSCONFIG_DMA_REQ_DATA_OUT_EN</name>
              <description>DMA Request Data Out Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>DES_SYSCONFIG_DMA_REQ_CONTEXT_IN_EN</name>
              <description>DMA Request Context In Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSSTATUS</name>
          <description>DES System Status</description>
          <addressOffset>0x00000038</addressOffset>
          <fields>
            <field>
              <name>DES_SYSSTATUS_RESETDONE</name>
              <description>Reset Done</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQSTATUS</name>
          <description>DES Interrupt Status</description>
          <addressOffset>0x0000003C</addressOffset>
          <fields>
            <field>
              <name>DES_IRQSTATUS_CONTEX_IN</name>
              <description>This bit indicates context interrupt is active and triggers the interrupt output</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DES_IRQSTATUS_DATA_IN</name>
              <description>This bit indicates data input interrupt is active and triggers the interrupt output</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>DES_IRQSTATUS_DATA_OUT</name>
              <description>This bit indicates data output interrupt is active and triggers the interrupt output</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQENABLE</name>
          <description>DES Interrupt Enable</description>
          <addressOffset>0x00000040</addressOffset>
          <fields>
            <field>
              <name>DES_IRQENABLE_M_CONTEX_IN</name>
              <description>If this bit is set to 1 the context interrupt is enabled</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DES_IRQENABLE_M_DATA_IN</name>
              <description>If this bit is set to 1 the data input interrupt is enabled</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>DES_IRQENABLE_M_DATA_OUT</name>
              <description>If this bit is set to 1 the data output interrupt is enabled</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DIRTYBITS</name>
          <description>DES Dirty Bits</description>
          <addressOffset>0x00000044</addressOffset>
          <fields>
            <field>
              <name>DES_DIRTYBITS_S_ACCESS</name>
              <description>This bit is set to 1 by the module if any of the DES_* registers is read</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DES_DIRTYBITS_S_DIRTY</name>
              <description>This bit is set to 1 by the module if any of the DES_* registers is written</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
